# Pandas

In [1]:
import pandas as pd 
import numpy as np

# Series

In [2]:
#creating by np array
series=pd.Series(np.arange(1,6),index=['a','b','c',"d",'e'])
series

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [3]:
print(series[1:4])
print(series['b'])
print(series.iloc[3])
print(series.loc['e'])

b    2
c    3
d    4
dtype: int64
2
4
5

In [4]:
series1=pd.Series({'name':'Ronesh','surname':'Gangavani','salary':40000})
series1

name          Ronesh
surname    Gangavani
salary         40000
dtype: object

In [5]:
print(series1['name'])
print(series1[:2])

Ronesh
name          Ronesh
surname    Gangavani
dtype: object

# DataFrame

In [8]:
list1=[[2,3,4],[4,5,6],[5,6,7]]
df=pd.DataFrame(list1)
df

   0  1  2
0  2  3  4
1  4  5  6
2  5  6  7

In [10]:
list1=[[2,3,4],[4,5,6],[5,6,7]]
df=pd.DataFrame(list1,columns=['a','b','c'],index=['x','y','z'])
df

   a  b  c
x  2  3  4
y  4  5  6
z  5  6  7

In [14]:
dict1={'Name':['Ronesh','Antik','Arvind','Vishnu'],'Degree':['MCA','Btech','healthcare','BCA'],'City':['Nadiad','Nagpur','Mysour','Tamil']}

In [15]:
df1=pd.DataFrame(dict1)
df1

     Name      Degree    City
0  Ronesh         MCA  Nadiad
1   Antik       Btech  Nagpur
2  Arvind  healthcare  Mysour
3  Vishnu         BCA   Tamil

In [16]:
# df1=pd.DataFrame((1,2,3))
df1

     Name      Degree    City
0  Ronesh         MCA  Nadiad
1   Antik       Btech  Nagpur
2  Arvind  healthcare  Mysour
3  Vishnu         BCA   Tamil

In [17]:
print(df1[:4])

     Name      Degree    City
0  Ronesh         MCA  Nadiad
1   Antik       Btech  Nagpur
2  Arvind  healthcare  Mysour
3  Vishnu         BCA   Tamil

In [20]:
df1.Name[:2]

0    Ronesh
1     Antik
Name: Name, dtype: object

In [21]:
df1['Name'][:3]

0    Ronesh
1     Antik
2    Arvind
Name: Name, dtype: object

In [23]:
df1['Name'].head(2)

0    Ronesh
1     Antik
Name: Name, dtype: object

In [24]:
df1['Name'].tail(2)

2    Arvind
3    Vishnu
Name: Name, dtype: object

In [27]:
df1.iloc[:2]

     Name Degree    City
0  Ronesh    MCA  Nadiad
1   Antik  Btech  Nagpur

In [33]:
df1.loc[3]

Name      Vishnu
Degree       BCA
City       Tamil
Name: 3, dtype: object

In [35]:
df2=df1[df1['Name']=='Ronesh']
df2

     Name Degree    City
0  Ronesh    MCA  Nadiad

In [37]:
df1.replace('Tamil','Tamil Naddu')

     Name      Degree         City
0  Ronesh         MCA       Nadiad
1   Antik       Btech       Nagpur
2  Arvind  healthcare       Mysour
3  Vishnu         BCA  Tamil Naddu

In [42]:
df1.rename(columns={'Name':'name'})

     name      Degree    City
0  Ronesh         MCA  Nadiad
1   Antik       Btech  Nagpur
2  Arvind  healthcare  Mysour
3  Vishnu         BCA   Tamil

In [44]:
df1=df1.rename(columns={'Degree':'Branch'})
df1

     Name      Branch    City
0  Ronesh         MCA  Nadiad
1   Antik       Btech  Nagpur
2  Arvind  healthcare  Mysour
3  Vishnu         BCA   Tamil

In [47]:
df3=df1[:2]

In [48]:
df3

     Name Branch    City
0  Ronesh    MCA  Nadiad
1   Antik  Btech  Nagpur

In [61]:
df4=df1.set_index(['Name','Branch','City'])

In [64]:
df1

     Name      Branch    City
0  Ronesh         MCA  Nadiad
1   Antik       Btech  Nagpur
2  Arvind  healthcare  Mysour
3  Vishnu         BCA   Tamil

In [69]:
df1=pd.DataFrame(dict1,index=['a','b','c','d'])
df1

     Name      Degree    City
a  Ronesh         MCA  Nadiad
b   Antik       Btech  Nagpur
c  Arvind  healthcare  Mysour
d  Vishnu         BCA   Tamil

In [71]:
df1.loc['a':'c']

     Name      Degree    City
a  Ronesh         MCA  Nadiad
b   Antik       Btech  Nagpur
c  Arvind  healthcare  Mysour

In [76]:
df1.loc['a':'c','Name':'Degree']

     Name      Degree
a  Ronesh         MCA
b   Antik       Btech
c  Arvind  healthcare

In [77]:
df1.loc['a':'c','Name']

a    Ronesh
b     Antik
c    Arvind
Name: Name, dtype: object

In [89]:
df1.loc[:,['Name','Degree']]

     Name      Degree
a  Ronesh         MCA
b   Antik       Btech
c  Arvind  healthcare
d  Vishnu         BCA

In [87]:
df1.iloc[:,:2]

     Name      Degree
a  Ronesh         MCA
b   Antik       Btech
c  Arvind  healthcare
d  Vishnu         BCA

In [95]:
df1.iloc[:,-3:-1]

     Name      Degree
a  Ronesh         MCA
b   Antik       Btech
c  Arvind  healthcare
d  Vishnu         BCA

In [100]:
df1.iloc[:-1,-3:-1]

     Name      Degree
a  Ronesh         MCA
b   Antik       Btech
c  Arvind  healthcare

# Handling Missing Values

In [157]:
dict2={'Name':['Ronesh','Ankit','vishnu','Arvind','Vinay','Hemanth'],'Python':[50,50,70,50,80,70],'Java':[90,60,70,np.nan,np.nan,70],'Php':[60,70,np.nan,np.nan,80,70]}

In [158]:
df5=pd.DataFrame(dict2)
df5

      Name  Python  Java   Php
0   Ronesh      50  90.0  60.0
1    Ankit      50  60.0  70.0
2   vishnu      70  70.0   NaN
3   Arvind      50   NaN   NaN
4    Vinay      80   NaN  80.0
5  Hemanth      70  70.0  70.0

In [159]:
df5.dropna()  # default axis=0  here

      Name  Python  Java   Php
0   Ronesh      50  90.0  60.0
1    Ankit      50  60.0  70.0
5  Hemanth      70  70.0  70.0

In [160]:
df=df5.iloc[:,1:]

In [161]:
df

   Python  Java   Php
0      50  90.0  60.0
1      50  60.0  70.0
2      70  70.0   NaN
3      50   NaN   NaN
4      80   NaN  80.0
5      70  70.0  70.0

In [162]:
df.dropna(axis=1)

   Python
0      50
1      50
2      70
3      50
4      80
5      70

In [163]:
df

   Python  Java   Php
0      50  90.0  60.0
1      50  60.0  70.0
2      70  70.0   NaN
3      50   NaN   NaN
4      80   NaN  80.0
5      70  70.0  70.0

In [166]:
df.fillna('60')

   Python Java Php
0      50   90  60
1      50   60  70
2      70   70  60
3      50   60  60
4      80   60  80
5      70   70  70

In [174]:
d=np.mean(df)
d

Python    61.666667
Java      72.500000
Php       70.000000
dtype: float64

In [175]:
d=d.mean()

In [176]:
d

68.05555555555556

In [178]:
df.fillna(d).round()

   Python  Java   Php
0      50  90.0  60.0
1      50  60.0  70.0
2      70  70.0  68.0
3      50  68.0  68.0
4      80  68.0  80.0
5      70  70.0  70.0

In [179]:
dict2={'Name':['Ronesh','Ankit','vishnu','Arvind','Vinay','Hemanth'],'Python':[50,50,70,50,80,70],'Java':[90,60,70,0,0,70],'Php':[60,70,0,0,80,70]}

In [180]:
df6=pd.DataFrame(dict2)
df6

      Name  Python  Java  Php
0   Ronesh      50    90   60
1    Ankit      50    60   70
2   vishnu      70    70    0
3   Arvind      50     0    0
4    Vinay      80     0   80
5  Hemanth      70    70   70

In [183]:
df6=df6.replace(0,np.nan)

In [187]:
df6

      Name  Python  Java   Php
0   Ronesh      50  90.0  60.0
1    Ankit      50  60.0  70.0
2   vishnu      70  70.0   NaN
3   Arvind      50   NaN   NaN
4    Vinay      80   NaN  80.0
5  Hemanth      70  70.0  70.0

In [186]:
df6.dropna(axis=1)

      Name  Python
0   Ronesh      50
1    Ankit      50
2   vishnu      70
3   Arvind      50
4    Vinay      80
5  Hemanth      70

In [188]:
df6.dropna(0)

      Name  Python  Java   Php
0   Ronesh      50  90.0  60.0
1    Ankit      50  60.0  70.0
5  Hemanth      70  70.0  70.0

In [192]:
df6.fillna(df6.mean()).round()

      Name  Python  Java   Php
0   Ronesh      50  90.0  60.0
1    Ankit      50  60.0  70.0
2   vishnu      70  70.0  70.0
3   Arvind      50  72.0  70.0
4    Vinay      80  72.0  80.0
5  Hemanth      70  70.0  70.0

In [193]:
df6.fillna(df6.std()).round()

      Name  Python  Java   Php
0   Ronesh      50  90.0  60.0
1    Ankit      50  60.0  70.0
2   vishnu      70  70.0   8.0
3   Arvind      50  13.0   8.0
4    Vinay      80  13.0  80.0
5  Hemanth      70  70.0  70.0

Group

In [206]:
dict10={'Bike':['Yamaha','Suzuki','Hero','Yamaha','Hero'],'Speed':[90,90,70,75,150]}

In [207]:
bike=pd.DataFrame(dict10)
bike

     Bike  Speed
0  Yamaha     90
1  Suzuki     90
2    Hero     70
3  Yamaha     75
4    Hero    150

In [209]:
bike.groupby(bike['Bike']).mean()

        Speed
Bike
Hero    110.0
Suzuki   90.0
Yamaha   82.5

In [211]:
bike1=bike.groupby(bike['Bike']).sum()

In [212]:
bike.append(bike1)

          Bike  Speed
0       Yamaha     90
1       Suzuki     90
2         Hero     70
3       Yamaha     75
4         Hero    150
Hero       NaN    220
Suzuki     NaN     90
Yamaha     NaN    165